In [2]:
import pandas as pd
import numpy as np

In [18]:
# for reading files

df=pd.read_csv(r'C:\Users\chait\Downloads\usa_mercedes_benz_prices.csv')

In [21]:
df.head()

,Name,Mileage,Rating,Review Count,Price
0,2021 Mercedes-Benz A-Class A 220 4MATIC,"29,636 mi.",3.9,"1,800","$30,900"
1,2022 Mercedes-Benz AMG SL 63 Base,"5,540 mi.",4.7,"1,239","$139,999"
2,2022 Mercedes-Benz AMG SL 63 Base,"4,890 mi.",4.7,"1,239","$132,999"
3,2020 Mercedes-Benz AMG E 53 Base 4MATIC,"29,746 mi.",4.8,752,"$58,587"
4,2021 Mercedes-Benz AMG GLS 63 Base 4MATIC,"32,631 mi.",5.0,"1,502","$95,990"

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2429 entries, 0 to 2428
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          2429 non-null   object
 1   Mileage       2429 non-null   object
 2   Rating        2135 non-null   float64
 3   Review Count  2398 non-null   object
 4   Price         2429 non-null   object
dtypes: float64(1), object(4)
memory usage: 95.0+ KB

In [23]:
df.describe()

            Rating
count  2135.000000
mean      4.533724
std       0.386506
min       2.100000
25%       4.400000
50%       4.600000
75%       4.800000
max       5.000000

In [26]:
df['Rating'].value_counts()

Rating
4.8    370
4.7    332
4.9    268
4.6    263
4.5    226
4.3    165
4.4    152
4.0     85
4.2     55
5.0     52
3.9     51
3.2     16
4.1     16
3.6     15
3.4     14
3.8     11
3.7      9
2.9      9
3.1      9
3.0      5
2.7      4
2.1      3
2.5      2
3.5      2
3.3      1
Name: count, dtype: int64

In [30]:
df[df['Rating']>4.5]

,Name,Mileage,Rating,Review Count,Price
1,2022 Mercedes-Benz AMG SL 63 Base,"5,540 mi.",4.7,"1,239","$139,999"
2,2022 Mercedes-Benz AMG SL 63 Base,"4,890 mi.",4.7,"1,239","$132,999"
3,2020 Mercedes-Benz AMG E 53 Base 4MATIC,"29,746 mi.",4.8,752,"$58,587"
4,2021 Mercedes-Benz AMG GLS 63 Base 4MATIC,"32,631 mi.",5.0,"1,502","$95,990"
5,2022 Mercedes-Benz AMG E 53 Base 4MATIC,"3,573 mi.",4.7,"1,239","$74,999"
...,...,...,...,...,...
2420,2021 Mercedes-Benz GLC 300 Base 4MATIC,"47,890 mi.",4.6,716,"$35,416"
2421,2023 Mercedes-Benz AMG GT 43 Base,"3,071 mi.",4.7,"1,239","$85,999"
2423,2020 Mercedes-Benz AMG GT 53 Base,"36,814 mi.",4.7,"1,424","$75,577"
2426,2021 Mercedes-Benz GLB 250 Base 4MATIC,"30,392 mi.",4.9,"2,375","$32,890"
2427,2023 Mercedes-Benz E-Class E 450 4MATIC,"3,413 mi.",4.8,"1,758","$53,983"

In [32]:
from io import StringIO, BytesIO

In [34]:
data=('col1,col2,col3\n'
          'x,y,1\n'
            'a,b,3\n'
            'c,d,5')

In [35]:
type(data)

str

In [37]:
pd.read_csv(StringIO(data))

  col1 col2  col3
0    x    y     1
1    a    b     3
2    c    d     5

In [43]:
df=pd.read_csv(StringIO(data),usecols=['col1','col3'])

In [44]:
df.head()

  col1  col3
0    x     1
1    a     3
2    c     5

In [45]:
# coverting 

df.to_csv('Test.csv')

In [48]:
## specifying columns data typ

data1 = ('col1,col2,col3\n'
        '1,2,3\n'
        '4,5,6\n'
        '7,8,9')

In [49]:
print(data1)

col1,col2,col3
1,2,3
4,5,6
7,8,9

In [66]:
df=pd.read_csv(StringIO(data1),dtype=object)

In [67]:
df

  col1 col2 col3
0    1    2    3
1    4    5    6
2    7    8    9

In [68]:
df['col1'][2]

'7'

In [69]:
df=pd.read_csv(StringIO(data1),dtype={'col1':int,'col2':float,'col3':object})

In [70]:
df['col1'][0]

np.int64(1)

In [71]:
df['col2'][2]

np.float64(8.0)

In [72]:
df['col3'][1]

'6'

In [73]:
df

   col1  col2 col3
0     1   2.0    3
1     4   5.0    6
2     7   8.0    9

In [88]:
data2 = 'a,b\n"hello, \\"bob\\",nice to see you"'

In [90]:
pd.read_csv(StringIO(data2),escapechar='\\')

            a                b
0  hello, ob  nice to see you